In [1]:
import pandas as pd
import os
import datetime

In [2]:
PATH = 'Crowd/resultados/'

In [3]:
seeds = [f for f in os.listdir(PATH) if not f.startswith('.') and not f.endswith('.csv')]
len(seeds)

23

## 1st degree

In [4]:
df_list = []
for seed in seeds:
    print('Current seed: %s' % seed)
    dir_ = PATH + ('%s/' % seed)
    files = os.listdir(dir_)
    files = [f for f in files if f.startswith('1st-degree')]
    assert(len(files) == 1)
    print(files)
    df_ = pd.read_csv(dir_ + files[0])
    print('Total records: %d' % df_[df_['active'] == 1].shape[0])
    df_list.append(df_)
    print('========================')
    print('========================')
#     break
    
len(df_list)

data_1 = pd.concat(df_list)
data_1.drop(['index'], inplace=True, axis=1)

Current seed: cabrera_kevin
['1st-degree_2018-05-20_1505.csv']
Total records: 83
========================
========================
Current seed: alvarez_kevin
['1st-degree_2018-06-16_1410.csv']
Total records: 115
========================
========================
Current seed: arevalo_esteban
['1st-degree_2018-06-04_0852.csv']
Total records: 150
========================
========================
Current seed: velasquez_milton
['1st-degree_2018-05-26_1433.csv']
Total records: 125
========================
========================
Current seed: guncay_andrea
['1st-degree_2018-06-07_0817.csv']
Total records: 215
========================
========================
Current seed: jaramillo_ronaldo
['1st-degree_2018-06-01_0749.csv']
Total records: 90
========================
========================
Current seed: pardo_carlos
['1st-degree_2018-05-19_0745.csv']
Total records: 119
========================
========================
Current seed: arevalo_david
['1st-degree_2018-05-23_2354.csv']
Total records: 75
========================
========================
Current seed: vicuna_freddy
['1st-degree_2018-05-23_0816.csv']
Total records: 44
========================
========================
Current seed: cuadrado_ismael
['1st-degree_2018-06-13_1035.csv']
Total records: 142
========================
========================
Current seed: cabrera_andrea
['1st-degree_2018-06-09_0932.csv']
Total records: 168
========================
========================
Current seed: sigua_bryan
['1st-degree_2018-05-24_1557.csv']
Total records: 163
========================
========================
Current seed: perez_katherine
['1st-degree_2018-06-01_0944.csv']
Total records: 343
========================
========================
Current seed: guaman_edgar
['1st-degree_2018-06-09_1042.csv']
Total records: 229
========================
========================
Current seed: galarza_ang
['1st-degree_2018-06-13_1801.csv']
Total records: 190
========================
========================
Current seed: vasquez_karla
['1st-degree_2018-06-13_1717.csv']
Total records: 125
========================
========================
Current seed: orellana_patricia
['1st-degree_2018-05-22_1606.csv']
Total records: 237
========================
========================
Current seed: pacheco_dayanna
['1st-degree_2018-05-23_2143.csv']
Total records: 240
========================
========================
Current seed: guiracocha_santiago
['1st-degree_2018-05-23_1841.csv']
Total records: 267
========================
========================
Current seed: chiriapo_gabriela
['1st-degree_2018-06-05_0116.csv']
Total records: 259
========================
========================
Current seed: martinez_josue
['1st-degree_2018-06-07_1850.csv']
Total records: 152
========================
========================
Current seed: ramon_angel
['1st-degree_2018-06-09_2224.csv']
Total records: 100
========================
========================
Current seed: nasque_maritza
['1st-degree_2018-05-31_1924.csv']
Total records: 36
========================
========================

## 2nd degree

In [5]:
df_list = []
for seed in seeds:
    print('Current seed: %s' % seed)
    dir_ = PATH + ('%s/' % seed)
    files = os.listdir(dir_)
    files = [f for f in files if f.startswith('2nd-degree') and f.find('SKIPPED') == -1]
    print(files)
    df_subset_list = [pd.read_csv(dir_ + f) for f in files]
    df_subset = pd.concat(df_subset_list)
    print('Total records: %d' % df_subset.shape[0])
    df_list.append(df_subset)
    print('========================')
    print('========================')
#     break
    
len(df_list)

Current seed: cabrera_kevin
['2nd-degree_2018-05-21_160036.csv', '2nd-degree_2018-05-20_151023.csv']
Total records: 42250
========================
========================
Current seed: alvarez_kevin
['2nd-degree_2018-06-17_065724.csv', '2nd-degree_2018-06-16_215258.csv', '2nd-degree_2018-06-17_111420.csv', '2nd-degree_2018-06-16_141234.csv']
Total records: 63261
========================
========================
Current seed: arevalo_esteban
['2nd-degree_2018-06-04_124945.csv', '2nd-degree_2018-06-04_104649.csv', '2nd-degree_2018-06-04_085331.csv', '2nd-degree_2018-06-04_152848.csv']
Total records: 100654
========================
========================
Current seed: velasquez_milton
['2nd-degree_2018-05-27_164138.csv', '2nd-degree_2018-05-26_184833.csv', '2nd-degree_2018-05-27_080206.csv', '2nd-degree_2018-05-27_001630.csv']
Total records: 120122
========================
========================
Current seed: guncay_andrea
['2nd-degree_2018-06-08_135643.csv', '2nd-degree_2018-06-08_174631.csv', '2nd-degree_2018-06-09_073507.csv', '2nd-degree_2018-06-08_221524.csv']
Total records: 184445
========================
========================
Current seed: jaramillo_ronaldo
['2nd-degree_2018-06-01_124923.csv', '2nd-degree_2018-06-01_164928.csv']
Total records: 40020
========================
========================
Current seed: pardo_carlos
['2nd-degree_2018-05-19_151729.csv', '2nd-degree_2018-05-19_094719.csv', '2nd-degree_2018-05-19_121600.csv']
Total records: 105809
========================
========================
Current seed: arevalo_david
['2nd-degree_2018-05-24_135634.csv', '2nd-degree_2018-05-24_000635.csv']
Total records: 70265
========================
========================
Current seed: vicuna_freddy
['2nd-degree_2018-05-23_082313.csv']
Total records: 44935
========================
========================
Current seed: cuadrado_ismael
['2nd-degree_2018-06-13_214002.csv', '2nd-degree_2018-06-13_162705.csv', '2nd-degree_2018-06-13_113830.csv']
Total records: 114474
========================
========================
Current seed: cabrera_andrea
['2nd-degree_2018-06-09_182148.csv', '2nd-degree_2018-06-09_111948.csv', '2nd-degree_2018-06-09_182139.csv', '2nd-degree_2018-06-09_111959.csv']
Total records: 140365
========================
========================
Current seed: sigua_bryan
['2nd-degree_2018-05-25_131202.csv', '2nd-degree_2018-05-24_160221.csv', '2nd-degree_2018-05-25_141019.csv', '2nd-degree_2018-05-25_104528.csv']
Total records: 74514
========================
========================
Current seed: perez_katherine
['2nd-degree_2018-06-09_125549.csv', '2nd-degree_2018-06-11_070642.csv', '2nd-degree_2018-06-15_095840.csv', '2nd-degree_2018-06-12_063021.csv', '2nd-degree_2018-06-10_073735.csv', '2nd-degree_2018-06-13_151414.csv', '2nd-degree_2018-06-13_110845.csv', '2nd-degree_2018-06-13_205405.csv', '2nd-degree_2018-06-14_080339.csv', '2nd-degree_2018-06-12_221223.csv', '2nd-degree_2018-06-14_195526.csv', '2nd-degree_2018-06-10_144507.csv', '2nd-degree_2018-06-15_060240.csv', '2nd-degree_2018-06-12_093153.csv', '2nd-degree_2018-06-13_190151.csv', '2nd-degree_2018-06-08_182047.csv', '2nd-degree_2018-06-15_105754.csv', '2nd-degree_2018-06-10_120819.csv', '2nd-degree_2018-06-15_021444.csv', '2nd-degree_2018-06-10_171857.csv', '2nd-degree_2018-06-14_180144.csv', '2nd-degree_2018-06-13_133058.csv', '2nd-degree_2018-06-11_082545.csv', '2nd-degree_2018-06-09_105904.csv']
Total records: 414576
========================
========================
Current seed: guaman_edgar
['2nd-degree_2018-06-10_000745.csv', '2nd-degree_2018-06-10_042402.csv', '2nd-degree_2018-06-09_230413.csv', '2nd-degree_2018-06-10_051137.csv', '2nd-degree_2018-06-09_104711.csv', '2nd-degree_2018-06-09_131435.csv', '2nd-degree_2018-06-09_150804.csv', '2nd-degree_2018-06-09_191543.csv', '2nd-degree_2018-06-11_144918.csv']
Total records: 272963
========================
========================
Current seed: galarza_ang
['2nd-degree_2018-06-14_160445.csv', '2nd-degree_2018-06-13_201038.csv', '2nd-degree_2018-06-13_180550.csv', '2nd-degree_2018-06-14_080750.csv']
Total records: 64280
========================
========================
Current seed: vasquez_karla
['2nd-degree_2018-06-21_040902.csv', '2nd-degree_2018-06-21_010945.csv', '2nd-degree_2018-06-18_050250.csv']
Total records: 54922
========================
========================
Current seed: orellana_patricia
['2nd-degree_2018-06-02_144609.csv', '2nd-degree_2018-06-06_152254.csv', '2nd-degree_2018-06-03_084739.csv', '2nd-degree_2018-06-03_125057.csv', '2nd-degree_2018-06-03_101656.csv']
Total records: 179767
========================
========================
Current seed: pacheco_dayanna
['2nd-degree_2018-05-23_225835.csv', '2nd-degree_2018-06-01_214207.csv', '2nd-degree_2018-05-24_203435.csv', '2nd-degree_2018-06-03_105959.csv', '2nd-degree_2018-06-03_155818.csv']
Total records: 140410
========================
========================
Current seed: guiracocha_santiago
['2nd-degree_2018-05-24_005656.csv', '2nd-degree_2018-05-24_142903.csv', '2nd-degree_2018-05-24_131949.csv', '2nd-degree_2018-05-23_232326.csv', '2nd-degree_2018-05-24_113916.csv', '2nd-degree_2018-05-24_124229.csv', '2nd-degree_2018-05-23_212807.csv', '2nd-degree_2018-05-24_144453.csv', '2nd-degree_2018-05-24_135040.csv', '2nd-degree_2018-05-23_184757.csv', '2nd-degree_2018-05-24_121011.csv', '2nd-degree_2018-05-24_130326.csv', '2nd-degree_2018-05-24_141722.csv', '2nd-degree_2018-05-24_092426.csv', '2nd-degree_2018-05-24_122535.csv']
Total records: 364531
========================
========================
Current seed: chiriapo_gabriela
['2nd-degree_2018-06-05_012413.csv', '2nd-degree_2018-06-06_045155.csv', '2nd-degree_2018-06-05_025959.csv', '2nd-degree_2018-06-06_021912.csv', '2nd-degree_2018-06-05_233806.csv', '2nd-degree_2018-06-05_120907.csv']
Total records: 196687
========================
========================
Current seed: martinez_josue
['2nd-degree_2018-06-07_185237.csv', '2nd-degree_2018-06-12_171536.csv', '2nd-degree_2018-06-08_190720.csv', '2nd-degree_2018-06-08_032910.csv', '2nd-degree_2018-06-10_180513.csv']
Total records: 153572
========================
========================
Current seed: ramon_angel
['2nd-degree_2018-06-10_064201.csv', '2nd-degree_2018-06-09_222833.csv', '2nd-degree_2018-06-10_160807.csv']
Total records: 95340
========================
========================
Current seed: nasque_maritza
['2nd-degree_2018-05-31_192935.csv']
Total records: 23748
========================
========================

23

In [6]:
data_2 = pd.concat(df_list)
data_2.head()

,A_id,B_id,A_name,B_name,active
0,100001756083977,100002026905899,Guido Vargas Gonzalez,Paula Calle Luzuriaga,1
1,100001756083977,100000736371638,Guido Vargas Gonzalez,Aylin Castillo,1
2,100001756083977,100003196139071,Guido Vargas Gonzalez,Odalys Pinos,1
3,100001756083977,100002324121722,Guido Vargas Gonzalez,Andres Pesantez Coronel,1
4,100001756083977,100006823800958,Guido Vargas Gonzalez,Paulina Lozano,1

## Data consolidation

In [7]:
df_master = pd.read_csv(PATH + '/1st-degree-seeds.csv')
df_master.head()

,A_id,A_name,B_id,B_name,active,processed
0,100001699374293,MasterNode,100022618663240,Perez Katherine,1,True
1,100001699374293,MasterNode,100001924890299,Guiracocha Santiago,1,True
2,100001699374293,MasterNode,100008056815598,Gabriela Chiriapo,1,True
3,100001699374293,MasterNode,100026083432921,Pacheco Dayanna,1,True
4,100001699374293,MasterNode,100003246562216,Orellana Patricia,1,True

In [11]:
df_master.drop(['processed', 'active'], inplace=True, axis=1)

In [ ]:
# data_1 = pd.concat([df_master, data_1])

In [8]:
data_1.shape

(4322, 6)

In [9]:
data_1 = data_1[data_1.active == 1].copy()

In [10]:
data_1.shape

(3667, 6)

In [12]:
data_1.drop(['processed', 'active'], inplace=True, axis=1)

In [13]:
data_1.head()

              A_id A_name             B_id                    B_name
0  100008162021602     Me  100002026905899     Paula Calle Luzuriaga
1  100008162021602     Me  100008484491880    Xavier Ambuludí Torres
2  100008162021602     Me  100003131840031          Pedro Pérez Aray
3  100008162021602     Me  100002059929677  Santiago Ortiz Placencia
4  100008162021602     Me  100002825721395             Fernando Yupa

In [14]:
data_1.drop_duplicates(['A_id', 'B_id'], inplace=True)

In [15]:
print('Total records on 2nd degree: %d' % (data_1.shape[0]))

Total records on 2nd degree: 3667

In [16]:
data_2.shape

(3061910, 5)

In [17]:
data_2 = data_2[data_2.active == 1].copy()

In [18]:
data_2.shape

(3061910, 5)

In [19]:
data_2.drop_duplicates(['A_id', 'B_id'], inplace=True)

In [20]:
data_2.head()

,A_id,B_id,A_name,B_name,active
0,100001756083977,100002026905899,Guido Vargas Gonzalez,Paula Calle Luzuriaga,1
1,100001756083977,100000736371638,Guido Vargas Gonzalez,Aylin Castillo,1
2,100001756083977,100003196139071,Guido Vargas Gonzalez,Odalys Pinos,1
3,100001756083977,100002324121722,Guido Vargas Gonzalez,Andres Pesantez Coronel,1
4,100001756083977,100006823800958,Guido Vargas Gonzalez,Paulina Lozano,1

In [21]:
data_2.shape

(2806783, 5)

In [22]:
data_2.drop(['active'], inplace=True, axis=1)

In [23]:
data_2.head()

,A_id,B_id,A_name,B_name
0,100001756083977,100002026905899,Guido Vargas Gonzalez,Paula Calle Luzuriaga
1,100001756083977,100000736371638,Guido Vargas Gonzalez,Aylin Castillo
2,100001756083977,100003196139071,Guido Vargas Gonzalez,Odalys Pinos
3,100001756083977,100002324121722,Guido Vargas Gonzalez,Andres Pesantez Coronel
4,100001756083977,100006823800958,Guido Vargas Gonzalez,Paulina Lozano

In [24]:
print('Total records on 3rd degree: %d' % data_2.shape[0])

Total records on 3rd degree: 2806783

## Index generation

In [25]:
df_index = pd.DataFrame(pd.concat([df_master['A_id'], df_master['B_id'], data_1['A_id'], data_1['B_id'], data_2['A_id'], data_2['B_id']]), columns=['fid'])
df_index.drop_duplicates(['fid'], inplace=True)
print(df_index.shape)
df_index.reset_index(inplace=True, drop=True)
df_index['id'] = df_index.index
df_index.set_index('fid', inplace=True)
df_index.head()

(968832, 1)

                 id
fid
100001699374293   0
100022618663240   1
100001924890299   2
100008056815598   3
100026083432921   4

In [26]:
data_1.head()

              A_id A_name             B_id                    B_name
0  100008162021602     Me  100002026905899     Paula Calle Luzuriaga
1  100008162021602     Me  100008484491880    Xavier Ambuludí Torres
2  100008162021602     Me  100003131840031          Pedro Pérez Aray
3  100008162021602     Me  100002059929677  Santiago Ortiz Placencia
4  100008162021602     Me  100002825721395             Fernando Yupa

In [27]:
df_master['Source'] = df_master['A_id'].map(df_index['id'])
df_master['Target'] = df_master['B_id'].map(df_index['id'])

In [28]:
data_1['Source'] = data_1['A_id'].map(df_index['id'])
data_1['Target'] = data_1['B_id'].map(df_index['id'])

In [29]:
data_2['Source'] = data_2['A_id'].map(df_index['id'])
data_2['Target'] = data_2['B_id'].map(df_index['id'])

## Graph Generation

In [30]:
PATH = 'Crowd/graph/'

In [31]:
if not os.path.isdir(PATH):
    os.mkdir(PATH)

In [32]:
data_1.head()

,A_id,A_name,B_id,B_name,Source,Target
0,100008162021602,Me,100002026905899,Paula Calle Luzuriaga,20,25
1,100008162021602,Me,100008484491880,Xavier Ambuludí Torres,20,26
2,100008162021602,Me,100003131840031,Pedro Pérez Aray,20,27
3,100008162021602,Me,100002059929677,Santiago Ortiz Placencia,20,28
4,100008162021602,Me,100002825721395,Fernando Yupa,20,29

In [ ]:
# MASTER_NODE = 100001699374293

In [ ]:
# data_0 = data_1[data_1['A_id'] == MASTER_NODE].copy()

In [35]:
# data_0.shape
df_master.head()

,A_id,A_name,B_id,B_name,Source,Target
0,100001699374293,MasterNode,100022618663240,Perez Katherine,0,1
1,100001699374293,MasterNode,100001924890299,Guiracocha Santiago,0,2
2,100001699374293,MasterNode,100008056815598,Gabriela Chiriapo,0,3
3,100001699374293,MasterNode,100026083432921,Pacheco Dayanna,0,4
4,100001699374293,MasterNode,100003246562216,Orellana Patricia,0,5

In [36]:
# data_0.to_csv(PATH + '1st-degree.csv', index=False)
df_master.to_csv(PATH + '1st-degree.csv', index=False)

In [ ]:
# data_1 = data_1[data_1['A_id'] != MASTER_NODE].copy()

In [37]:
data_1.to_csv(PATH + '2nd-degree.csv', index=False)

In [38]:
data_2.to_csv(PATH + '3rd-degree.csv', index=False)

In [39]:
df = pd.concat([df_master, data_1, data_2])
df.shape

(2810473, 6)

In [40]:
df.drop_duplicates(['A_id', 'B_id'], inplace=True)

In [41]:
df.shape

(2807785, 6)

In [45]:
mask = df['Source'] < df['Target']
df['first'] = df['Source'].where(mask, df['Target'])
df['second'] = df['Target'].where(mask, df['Source'])
df['d'] = df.duplicated(['first', 'second'])
print('Duplicated edges in undirected graph: %d' % (df[df['d'] == True].shape[0]))
df.drop_duplicates(['first', 'second'], inplace=True)

Duplicated edges in undirected graph: %d 55456

In [46]:
df.shape

(2752329, 9)

In [48]:
df.drop(['first', 'second', 'd'], inplace=True, axis=1)

In [49]:
df.head()

,A_id,A_name,B_id,B_name,Source,Target
0,100001699374293,MasterNode,100022618663240,Perez Katherine,0,1
1,100001699374293,MasterNode,100001924890299,Guiracocha Santiago,0,2
2,100001699374293,MasterNode,100008056815598,Gabriela Chiriapo,0,3
3,100001699374293,MasterNode,100026083432921,Pacheco Dayanna,0,4
4,100001699374293,MasterNode,100003246562216,Orellana Patricia,0,5

In [50]:
df.to_csv(PATH + 'social_graph-%s.csv' % datetime.datetime.now().strftime("%Y-%m-%d"), index=False)

In [51]:
df.shape

(2752329, 6)

## Edges/Nodes file generation

In [52]:
df_nodes = pd.DataFrame(pd.concat([df['Source'], df['Target']]), columns=['id'])
df_nodes.shape

(5504658, 1)

In [53]:
df_nodes.drop_duplicates('id', inplace=True)

In [54]:
df_nodes.shape

(968832, 1)

In [55]:
df_nodes.to_csv(PATH + 'nodes-%s.csv' % datetime.datetime.now().strftime("%Y-%m-%d"), index=False)

In [56]:
edges = df[['Source', 'Target']].copy()
edges.to_csv(PATH + 'edges-%s.csv' % datetime.datetime.now().strftime("%Y-%m-%d"), index=False)

In [57]:
edges.shape

(2752329, 2)